Show / Hide Table of Contents
Class PretensionedTendonGroupItem
The pretensionede tendon group item
Inheritance
System.Object
OpenObject
OpenElementId
Tendon
PretensionedTendonGroupItem
Inherited Members
 Tendon.Material
 Tendon.NumberOfStrand
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public class PretensionedTendonGroupItem : Tendon
Properties
Improve this Doc   View Source
Geometry
Geometry
Declaration
public Polygon3D Geometry { get; set; }
Property Value
 Type |  Description
 Polygon3D
 Improve this Doc
 View Source